УТ/src/Catalogs/CRM_ПапкиДиалогов/CRM_ПапкиДиалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПапкиДиалогов</name>
  <comment>Используется для гибкого распределения диалогов по папкам.</comment>
  <attributes>
    <name>Пользователь</name>
    <comment>Пользователь-владелец элемента справочника</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_УровниПоддержки/CRM_УровниПоддержки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УровниПоддержки</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.CRM_РежимыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <comment>Хранилище отбора для использования в алгоритмах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборСтрока</name>
    <comment>Представление отбора для отображения в списках</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ПапкиДиалогов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает таблицу диалогов группировок.
//
// Параметры:
//  Отбор			 - Отбор	 - Отбор.
//  ТаблицаКонтактов - ТаблицаЗначений	 - Таблица контактов.
// 
// Возвращаемое значение:
//   - ТаблицаЗначений
//
Функция ПолучитьДиалогиВПапку(Отбор, ТаблицаКонтактов) Экспорт
	
	Схема = ПолучитьСхемуКомпоновки(ТаблицаКонтактов);
	АдресСхемы = ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Настройки.Отбор.Элементы.Очистить();
	Справочники.CRM_УровниПоддержки.СкопироватьОтборКомпоновкиДанных(Настройки.Отбор, Отбор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,
		 Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	НаборыДанных = Новый Структура;
	НаборыДанных.Вставить("ДанныеКонтакты", ТаблицаКонтактов);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ПолучитьДиалогиВПапку()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеОтбораСхемыКомпоновкиДанных() Экспорт
	
	ОписаниеПолей	= Новый ТаблицаЗначений;
	РеквизитыОтбора	= Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	/////////////////////////
	// Реквизиты отбора пользователя.
	
	ОписаниеПолей.Колонки.Добавить(
		"Диалог",
		Новый ОписаниеТипов("СправочникСсылка.CRM_Диалоги"),
		НСтр("ru = 'Диалог'"));
	
	ОписаниеПолей.Колонки.Добавить(
		"УчетнаяЗапись",
		Новый ОписаниеТипов("СправочникСсылка.CRM_УчетныеЗаписиМессенджеров"),
		НСтр("ru = 'Учетная запись'"));
	
	Возврат ОписаниеПолей;
	
КонецФункции // ОписаниеТипаДанныхОтбораСхемыКомпоновкиДанных()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСхемуКомпоновки(ОписаниеПолей = Неопределено) Экспорт
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Наборданных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.Имя = "ДанныеКонтакты";
	Наборданных.ИмяОбъекта = "ДанныеКонтакты";
	
	Если ОписаниеПолей = Неопределено Тогда
		ОписаниеПолей = ОписаниеОтбораСхемыКомпоновкиДанных();
	КонецЕсли;
	
	НастройкиКомпоновки = СхемаКомпоновки.ВариантыНастроек[0].Настройки;
	
	Для Каждого Поле Из ОписаниеПолей.Колонки Цикл
		ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Заголовок	= Поле.Заголовок;
		ПолеНабора.Поле			= Поле.Имя;
		ПолеНабора.ПутьКДанным	= Поле.Имя;
		ПолеНабора.ТипЗначения	= Поле.ТипЗначения;
		
		ВыбранноеПоле = НастройкиКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(Поле.Имя);
	КонецЦикла;
	
	Группировка = НастройкиКомпоновки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат СхемаКомпоновки;
	
КонецФункции // ПолучитьСхемуКомпоновки()

#КонецОбласти

#КонецЕсли
